<div align="center">
<a href="https://vbti.nl"><img src="./images/vbti_logo.png" width="400"></a>
</div>

# Pandas

Many datasets in data science are stored as *data tables*. Data features are stored column by column, and data points are stored row by row. The Python package [Pandas](https://pandas.pydata.org/) provides data structures and tools to deal with data tables.

In [1]:
import numpy as np
import pandas as pd
pd.__version__

'0.22.0'

## Series objects

Pandas `Series` object is a 1-dimensional table with indexed data. The difference with a NumPy array is the index, which can be non-numerical.

In [2]:
# create series object
data = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
# access data as numpy array
data.values

array([1, 2, 3, 4, 5])

In [4]:
# index as array
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [5]:
# use index to access elements
data['c']

3

In [6]:
# use index range to access data
data['b':'d']

b    2
c    3
d    4
dtype: int64

In [7]:
# whenever an index is not defined, an integer index is created
data = pd.Series(['a', 'b', 'c', 'd'])
data

0    a
1    b
2    c
3    d
dtype: object

Python dictionary can be converted to a Pandas `Series` object.

In [8]:
data_dict = {'A' : 10, 'R' : 3, 'K' : 5, 'B' : 8}
data = pd.Series(data_dict)
data

A    10
B     8
K     5
R     3
dtype: int64

In [9]:
# the index will be sorted
data.index

Index(['A', 'B', 'K', 'R'], dtype='object')

## DataFrame

A Pandas `DataFrame` object is a data table object. Features are stored in columns and are represented as a `Series` objects. Every column can have its data type.

In [10]:
# create DataFrame from Series objects
data_s1 = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
data_s2 = pd.Series([9, 8, 7, 6, 5], index=['a', 'b', 'c', 'd', 'e'])
data_df = pd.DataFrame({'Series1' : data_s1, 'Series2' : data_s2})
data_df

   Series1  Series2
a        1        9
b        2        8
c        3        7
d        4        6
e        5        5

In [11]:
# use column name to select a column
data_df['Series1']

a    1
b    2
c    3
d    4
e    5
Name: Series1, dtype: int64

In [12]:
# use column name and indext to select an item
data_df['Series1']['c']

3

## Index object

Both a `Series` and `DataFrame` objects make use of an immutable 'Index' object.

In [13]:
indexA = pd.Index(['a', 'e', 'g', 'i'])
indexB = pd.Index(['b', 'c', 'i', 'k', 'l'])

# intersection
indexA & indexB

Index(['i'], dtype='object')

In [14]:
# union
indexA | indexB

Index(['a', 'b', 'c', 'e', 'g', 'i', 'k', 'l'], dtype='object')

## Read and write CVS data

Pandas data objects can be easily stored as CSV (comma seperated file) files. Here is a CSV example 

```
product,price,number
apple,0.99,10
pear,0.87,5
strawberry,3.54,14
```

Below we use the well known [Titanic dataset](http://biostat.mc.vanderbilt.edu/DataSets).

In [15]:
# read csv file
titanic = pd.read_csv('titanic3.csv');

In [16]:
# print first 5 rows 
titanic.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [17]:
# check data types
titanic.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [18]:
# check some statistics
titanic[['survived', 'age', 'fare']].describe()

          survived          age         fare
count  1309.000000  1046.000000  1308.000000
mean      0.381971    29.881138    33.295479
std       0.486055    14.413493    51.758668
min       0.000000     0.170000     0.000000
25%       0.000000    21.000000     7.895800
50%       0.000000    28.000000    14.454200
75%       1.000000    39.000000    31.275000
max       1.000000    80.000000   512.329200

In [19]:
# calculate probability to survive for passengers younger than 60 years, and equals or older than 60 years
idx = (titanic['age'] < 60) # boolean index
titanic['survived'][idx].mean(), titanic['survived'][~idx].mean()

(0.4125248508946322, 0.28052805280528054)

In [20]:
# calculate probability to survive for male vs female
idx = (titanic['sex'] == 'male') # boolean index
titanic['survived'][idx].mean(), titanic['survived'][~idx].mean()

(0.19098457888493475, 0.7274678111587983)

In [21]:
# read only specific columns from a csv file
titanic_subset = pd.read_csv('titanic3.csv', usecols=['survived', 'sex', 'age', 'fare']);
titanic_subset.head(5)

   survived     sex    age      fare
0         1  female  29.00  211.3375
1         1    male   0.92  151.5500
2         0  female   2.00  151.5500
3         0    male  30.00  151.5500
4         0  female  25.00  151.5500

Defining the datatype per columns when reading a csv file speeds up reading the data and might avoid errors.

In [22]:
# read cvs file with specified data types
titanic_subset = pd.read_csv('titanic3.csv', usecols=['survived', 'sex', 'age', 'fare'], \
                             dtype={'survived' : np.bool_, 'sex' : np.str, 'age' : np.float32, 'fare' : np.float32});
titanic_subset.head(5)

   survived     sex    age        fare
0      True  female  29.00  211.337494
1      True    male   0.92  151.550003
2     False  female   2.00  151.550003
3     False    male  30.00  151.550003
4     False  female  25.00  151.550003

In [23]:
# write a DataFrame to a csv file
data_df.to_csv('test.csv')

## Data frame operations

The data in a Pandas DataFrame can be modified by operators.

In [24]:
x = titanic['fare'] / 1000
x.head(5)

0    0.211338
1    0.151550
2    0.151550
3    0.151550
4    0.151550
Name: fare, dtype: float64

In [25]:
# create new column
titanic['fare1000'] = titanic['fare'] / 1000
titanic.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,fare1000
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",0.211338
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0.151550
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0.151550
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0.151550
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0.151550

In [26]:
# aggregate over all values in a column
titanic['fare'].sum(), titanic['fare'].mean(), titanic['fare'].min(), titanic['fare'].max()

(43550.4869, 33.29547928134557, 0.0, 512.3292)

In [27]:
# you can do the same by using aggregate `agg()` method.
titanic['fare'].agg(['sum', 'mean', 'min', 'max'])

sum     43550.486900
mean       33.295479
min         0.000000
max       512.329200
Name: fare, dtype: float64

In [28]:
# drop a column
# inplace=False : the method returns a new data frames
# inplace=True : the method removes the column from the object
titanic.drop('fare1000', axis=1, inplace=True)
titanic.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

## Merge and split data frames

In [29]:
df1 = pd.DataFrame({'A' : ['a', 'b', 'c', 'd'], 'B' : [1, 2, 3, 4]})
df1

   A  B
0  a  1
1  b  2
2  c  3
3  d  4

In [30]:
df2 = pd.DataFrame({'A' : ['e', 'f', 'g', 'h'], 'B' : [5, 6, 7, 8]})
df2

   A  B
0  e  5
1  f  6
2  g  7
3  h  8

In [31]:
# Concatenate DataFrames
# Note: create a new index via `ignore_index=True`
pd.concat([df1, df2], axis=0, ignore_index=True)

   A  B
0  a  1
1  b  2
2  c  3
3  d  4
4  e  5
5  f  6
6  g  7
7  h  8

In [32]:
# Concatenate data frames via other axis
pd.concat([df1, df2], axis=1)

   A  B  A  B
0  a  1  e  5
1  b  2  f  6
2  c  3  g  7
3  d  4  h  8

Pandas data frames can also be combined using the `merge` function. Several ways to merge includes *inner join*, *outer join*, *left outer join*, and *right outer join*.

<div align="center">
<img src="./images/table_merge.png" width="400">
</div>

In [33]:
# create first data frame
df_products = pd.DataFrame({'product_id' : [1, 2, 3, 4, 5], \
                             'name' : ['toiletpaper', 'soda', 'egg', 'sugar', 'milk'], \
                             'price' : [5.50, 2.30, 0.05, 0.1, 0.99]}, \
                             columns=['product_id', 'name', 'price'])
df_products

   product_id         name  price
0           1  toiletpaper   5.50
1           2         soda   2.30
2           3          egg   0.05
3           4        sugar   0.10
4           5         milk   0.99

In [34]:
# create second data frame
df_sales = pd.DataFrame({'product_id' : [1, 4, 5], 'number' : [8, 5, 12]}, columns=['product_id', 'number'])
df_sales

   product_id  number
0           1       8
1           4       5
2           5      12

In [35]:
# inner join
pd.merge(df_products, df_sales, on='product_id')
# equals pd.merge(df_product, df_sales, left_on='product_id', right_on='product_id')

   product_id         name  price  number
0           1  toiletpaper   5.50       8
1           4        sugar   0.10       5
2           5         milk   0.99      12

In [36]:
# outer join
pd.merge(df_products, df_sales, on='product_id', how='outer')

   product_id         name  price  number
0           1  toiletpaper   5.50     8.0
1           2         soda   2.30     NaN
2           3          egg   0.05     NaN
3           4        sugar   0.10     5.0
4           5         milk   0.99    12.0

In [37]:
# left outer join
pd.merge(df_products, df_sales, on='product_id', how='left')

   product_id         name  price  number
0           1  toiletpaper   5.50     8.0
1           2         soda   2.30     NaN
2           3          egg   0.05     NaN
3           4        sugar   0.10     5.0
4           5         milk   0.99    12.0

In [38]:
# right outer join
pd.merge(df_products, df_sales, on='product_id', how='right')

   product_id         name  price  number
0           1  toiletpaper   5.50       8
1           4        sugar   0.10       5
2           5         milk   0.99      12